// Напишите программу, которая на вход принимает число (N),
// а на выходе показывает все чётные числа от 1 до N.
//
// 5-> 2, 4
// 8-> 2, 4, 6, 8

Console.WriteLine("Your number is:");
int num = Convert.ToInt32(Console.ReadLine());
int i;
int N = 1;

for (i=1; i<=num; i++)
   if { 

   }
    N+=i;
    Console.WriteLine(N);
// while (N > num)
// {
//    if (N % 2 == 0)
//    {
//        Console.WriteLine(N);
//
//        N++;
//    }
// }